Taking the specific issue reported by @luoymu into account this is pretty easy. 

Here are the specifics of my reproduction:
- Terraform v.1.1.4 on macOS
- Terraform Provider for VMware vSphere v2.0.2
- VMware vSphere v7.0.1
- Amazon Linux 2 OVA (as used in the issue description) v2.0.20200617.0 (`amzn2-vmware_esx-2.0.20200617.0-x86_64.xfs.gpt.ova`)

One of the first things to note is that we need the content of the .ovf file to see if there are any vApp properties to apply. There are various ways to do so, but the fastest to just untar the `.ova` and open the `.ovf` file. In this example, there are no vApp properties but there is the "**bridged**" network we do want to capture.

```xml
  <NetworkSection>
    <Info>The list of logical networks</Info>
    <Network ovf:name="bridged">                                 # <<< ---- there it is.
      <Description>The bridged network</Description>
    </Network>
  </NetworkSection>
```

So, below I've had included a simple, flat version of a plan which uses the `vsphere_ovf_vm_template` data source. This is where I also pass the name of the network to the `ovf_network_map`.

`main.tf`

```hcl
terraform {
  required_providers {
    vsphere = {
      source  = "hashicorp/vsphere"
      version = ">= 2.0.2"
    }
  }
  required_version = ">= 1.1.4"
}

provider "vsphere" {
  vsphere_server       = "m01-vc01.rainpole.io"
  user                 = "administrator@vsphere.local"
  password             = "VMware1!"
  allow_unverified_ssl = true
}

data "vsphere_datacenter" "datacenter" {
  name = "m01-dc01"
}

data "vsphere_datastore" "datastore" {
  name          = "local-ssd-01"
  datacenter_id = data.vsphere_datacenter.datacenter.id
}

data "vsphere_compute_cluster" "cluster" {
  name          = "m01-cl01"
  datacenter_id = data.vsphere_datacenter.datacenter.id
}

data "vsphere_resource_pool" "pool" {
  name          = format("%s%s", data.vsphere_compute_cluster.cluster.name, "/Resources")
  datacenter_id = data.vsphere_datacenter.datacenter.id
}

data "vsphere_host" "host" {
  name          = "m01-esx01.rainpole.io"
  datacenter_id = data.vsphere_datacenter.datacenter.id
}

data "vsphere_network" "network" {
  name          = "M - 172.16.11.0"
  datacenter_id = data.vsphere_datacenter.datacenter.id
}

data "vsphere_ovf_vm_template" "ovf" {
  name             = "amzn"
  resource_pool_id = data.vsphere_resource_pool.pool.id
  datastore_id     = data.vsphere_datastore.datastore.id
  host_system_id   = data.vsphere_host.host.id
  local_ovf_path   = "/Users/rainpole/Downloads/amzn2-vmware_esx-2.0.20200617.0-x86_64.xfs.gpt.ova"
  ovf_network_map = {
    "bridged" : data.vsphere_network.network.id
  }
}

resource "vsphere_virtual_machine" "amzn" {
  name                 = "amzn"
  resource_pool_id     = data.vsphere_resource_pool.pool.id
  datastore_id         = data.vsphere_datastore.datastore.id
  datacenter_id        = data.vsphere_datacenter.datacenter.id
  host_system_id       = data.vsphere_host.host.id
  num_cpus             = data.vsphere_ovf_vm_template.ovf.num_cpus
  num_cores_per_socket = data.vsphere_ovf_vm_template.ovf.num_cores_per_socket
  memory               = data.vsphere_ovf_vm_template.ovf.memory
  guest_id             = data.vsphere_ovf_vm_template.ovf.guest_id
  nested_hv_enabled    = data.vsphere_ovf_vm_template.ovf.nested_hv_enabled
  dynamic "network_interface" {
    for_each = data.vsphere_ovf_vm_template.ovf.ovf_network_map
    content {
      network_id = network_interface.value
    }
  }
  wait_for_guest_net_timeout = 0
  wait_for_guest_ip_timeout  = 0

  cdrom {
    client_device = false
    datastore_id = data.vsphere_datastore.datastore.id
    path = "iso/seed.iso"    
  }

  ovf_deploy {
    allow_unverified_ssl_cert = true
    local_ovf_path            = "/Users/rainpole/Downloads/amzn2-vmware_esx-2.0.20200617.0-x86_64.xfs.gpt.ova"
    disk_provisioning         = "thin"
    ip_protocol               = "IPV4"
    ip_allocation_policy      = "STATIC_MANUAL"
    ovf_network_map           = data.vsphere_ovf_vm_template.ovf.ovf_network_map
  }

}
```

This image used `cloud-init` to configure the machine image, so you'll need to create the `seed.iso` and attach it in the config as seen below from the plan:

```hcl
....
  cdrom {
    client_device = false
    datastore_id = data.vsphere_datastore.datastore.id
    path = "iso/seed.iso"    
  }
...
```

To learn how to create this `seed.iso` for Amazon Linux 2, read [Run Amazon Linux 2 as a Virtual Machine On Premises](https://docs.aws.amazon.com/AWSEC2/latest/UserGuide/amazon-linux-2-virtual-machine.html).

**NOTE**: This isn't typically required by other templates that use `cloud-init` for guest customization (_e.g._, Ubuntu 20.04 LTS). For those you'd typically use the following, but not in this instance.

```hcl
resource "vsphere_virtual_machine" "vm" {
 # .... other config......
  extra_config = {
  "guestinfo.metadata"          = base64encode(file("${path.module}/metadata.yml"))
  "guestinfo.metadata.encoding" = "base64"
  "guestinfo.userdata"          = base64encode(file("${path.module}/userdata.yml"))
  "guestinfo.userdata.encoding" = "base64"
  }
}
```

Now run your plan and apply...

```console
❯ terraform apply --auto-approve

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following
symbols:
  + create

Terraform will perform the following actions:

  # vsphere_virtual_machine.amzn will be created
  + resource "vsphere_virtual_machine" "amzn" {
      + boot_retry_delay                        = 10000
      + change_version                          = (known after apply)
      + cpu_limit                               = -1
      + cpu_share_count                         = (known after apply)
      + cpu_share_level                         = "normal"
      + datacenter_id                           = "datacenter-3"
      + datastore_id                            = "datastore-11"
      + default_ip_address                      = (known after apply)
      + ept_rvi_mode                            = "automatic"
      + firmware                                = "bios"
      + force_power_off                         = true
      + guest_id                                = "other3xLinux64Guest"
      + guest_ip_addresses                      = (known after apply)
      + hardware_version                        = (known after apply)
      + host_system_id                          = "host-10"
      + hv_mode                                 = "hvAuto"
      + id                                      = (known after apply)
      + ide_controller_count                    = 2
      + imported                                = (known after apply)
      + latency_sensitivity                     = "normal"
      + memory                                  = 4096
      + memory_limit                            = -1
      + memory_share_count                      = (known after apply)
      + memory_share_level                      = "normal"
      + migrate_wait_timeout                    = 30
      + moid                                    = (known after apply)
      + name                                    = "amzn"
      + nested_hv_enabled                       = false
      + num_cores_per_socket                    = 1
      + num_cpus                                = 2
      + poweron_timeout                         = 300
      + reboot_required                         = (known after apply)
      + resource_pool_id                        = "resgroup-6046"
      + run_tools_scripts_after_power_on        = true
      + run_tools_scripts_after_resume          = true
      + run_tools_scripts_before_guest_shutdown = true
      + run_tools_scripts_before_guest_standby  = true
      + sata_controller_count                   = 0
      + scsi_bus_sharing                        = "noSharing"
      + scsi_controller_count                   = 1
      + scsi_type                               = "pvscsi"
      + shutdown_wait_timeout                   = 3
      + storage_policy_id                       = (known after apply)
      + swap_placement_policy                   = "inherit"
      + uuid                                    = (known after apply)
      + vapp_transport                          = (known after apply)
      + vmware_tools_status                     = (known after apply)
      + vmx_path                                = (known after apply)
      + wait_for_guest_ip_timeout               = 0
      + wait_for_guest_net_routable             = true
      + wait_for_guest_net_timeout              = 0

      + cdrom {
          + client_device  = false
          + datastore_id   = "datastore-11"
          + device_address = (known after apply)
          + key            = (known after apply)
          + path           = "iso/seed.iso"
        }

      + disk {
          + attach            = (known after apply)
          + controller_type   = (known after apply)
          + datastore_id      = (known after apply)
          + device_address    = (known after apply)
          + disk_mode         = (known after apply)
          + disk_sharing      = (known after apply)
          + eagerly_scrub     = (known after apply)
          + io_limit          = (known after apply)
          + io_reservation    = (known after apply)
          + io_share_count    = (known after apply)
          + io_share_level    = (known after apply)
          + keep_on_remove    = (known after apply)
          + key               = (known after apply)
          + label             = (known after apply)
          + path              = (known after apply)
          + size              = (known after apply)
          + storage_policy_id = (known after apply)
          + thin_provisioned  = (known after apply)
          + unit_number       = (known after apply)
          + uuid              = (known after apply)
          + write_through     = (known after apply)
        }

      + network_interface {
          + adapter_type          = "vmxnet3"
          + bandwidth_limit       = -1
          + bandwidth_reservation = 0
          + bandwidth_share_count = (known after apply)
          + bandwidth_share_level = "normal"
          + device_address        = (known after apply)
          + key                   = (known after apply)
          + mac_address           = (known after apply)
          + network_id            = "network-1001"
        }

      + ovf_deploy {
          + allow_unverified_ssl_cert = true
          + disk_provisioning         = "thin"
          + enable_hidden_properties  = false
          + ip_allocation_policy      = "STATIC_MANUAL"
          + ip_protocol               = "IPV4"
          + local_ovf_path            = "/Users/johnsonryan/Downloads/amzn2-vmware_esx-2.0.20200617.0-x86_64.xfs.gpt.ova"
          + ovf_network_map           = {
              + "bridged" = "network-1001"
            }
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.
vsphere_virtual_machine.amzn: Creating...
vsphere_virtual_machine.amzn: Still creating... [10s elapsed]
vsphere_virtual_machine.amzn: Still creating... [20s elapsed]
vsphere_virtual_machine.amzn: Still creating... [30s elapsed]
vsphere_virtual_machine.amzn: Still creating... [40s elapsed]
vsphere_virtual_machine.amzn: Still creating... [50s elapsed]
vsphere_virtual_machine.amzn: Still creating... [1m0s elapsed]
vsphere_virtual_machine.amzn: Still creating... [1m10s elapsed]
vsphere_virtual_machine.amzn: Still creating... [1m20s elapsed]
vsphere_virtual_machine.amzn: Still creating... [1m30s elapsed]
vsphere_virtual_machine.amzn: Still creating... [1m40s elapsed]
vsphere_virtual_machine.amzn: Still creating... [1m50s elapsed]
vsphere_virtual_machine.amzn: Still creating... [2m0s elapsed]
vsphere_virtual_machine.amzn: Still creating... [2m10s elapsed]
vsphere_virtual_machine.amzn: Still creating... [2m20s elapsed]
vsphere_virtual_machine.amzn: Still creating... [2m30s elapsed]
vsphere_virtual_machine.amzn: Still creating... [2m40s elapsed]
vsphere_virtual_machine.amzn: Still creating... [2m50s elapsed]
vsphere_virtual_machine.amzn: Still creating... [3m0s elapsed]
vsphere_virtual_machine.amzn: Still creating... [3m10s elapsed]
vsphere_virtual_machine.amzn: Still creating... [3m20s elapsed]
vsphere_virtual_machine.amzn: Still creating... [3m30s elapsed]
vsphere_virtual_machine.amzn: Still creating... [3m40s elapsed]
vsphere_virtual_machine.amzn: Still creating... [3m50s elapsed]
vsphere_virtual_machine.amzn: Still creating... [4m0s elapsed]
vsphere_virtual_machine.amzn: Still creating... [4m10s elapsed]
vsphere_virtual_machine.amzn: Still creating... [4m20s elapsed]
vsphere_virtual_machine.amzn: Still creating... [4m30s elapsed]
vsphere_virtual_machine.amzn: Still creating... [4m40s elapsed]
vsphere_virtual_machine.amzn: Still creating... [4m50s elapsed]
vsphere_virtual_machine.amzn: Still creating... [5m0s elapsed]
vsphere_virtual_machine.amzn: Still creating... [5m10s elapsed]
vsphere_virtual_machine.amzn: Still creating... [5m20s elapsed]
vsphere_virtual_machine.amzn: Still creating... [5m30s elapsed]
vsphere_virtual_machine.amzn: Still creating... [5m40s elapsed]
vsphere_virtual_machine.amzn: Still creating... [5m50s elapsed]
vsphere_virtual_machine.amzn: Still creating... [6m0s elapsed]
vsphere_virtual_machine.amzn: Still creating... [6m10s elapsed]
vsphere_virtual_machine.amzn: Still creating... [6m20s elapsed]
vsphere_virtual_machine.amzn: Creation complete after 6m27s [id=4202a964-fb53-5872-84b4-0312f4b56216]

Apply complete! Resources: 1 added, 0 changed, 0 destroyed.
```

![image](https://user-images.githubusercontent.com/7771363/151246924-3992762e-cdd0-4c90-99c1-4ff6b5f6edea.png)

That's it!

cc @appilon for review

Ryan